# -*- coding: utf-8 -*-
# -*- find-file-hook: org-babel-execute-buffer -*-

#+TITLE: Starter Kit Bindings
#+OPTIONS: toc:nil num:nil ^:nil

This is part of the [[file:starter-kit.org][Emacs Starter Kit]].

*** COMMENT =visual-regexp= on steroids: an extension
- DGM: turned off on 31/01/2020 to continue using the regular =visual-regexp= until I understand the version on steroids

- https://github.com/benma/visual-regexp-steroids.el
- https://www.reddit.com/r/emacs/comments/evdcie/back_to_cursors_stutteringchoppy_movement/

- Interesting: it'll make searches case sentitive.

#+BEGIN_SRC emacs-lisp
  ;; (use-package visual-regexp
  ;;   :defer)

  ;; (use-package visual-regexp-steroids
  ;;   :defer
  ;;   :demand
  ;;   :bind (("C-M-r" . vr/isearch-backward)
  ;;          ("C-M-s" . vr/isearch-forward)
  ;;          ("C-c q" . vr/query-replace)
  ;;          ("C-c r" . vr/replace)
  ;;          ("C-r"   . vr/isearch-backward) ;; C-M-r
  ;;          ("C-s"   . vr/isearch-forward) ;; C-M-s
  ;;          ))
#+END_SRC

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (24115 4119 835327 964000) :init (24115 4119 834970 275000) :init-secs (0 0 747 842000) :use-package-secs (0 0 1160 571000) :config (24115 4119 834609 132000) :config-secs (0 0 9 101000)))

** Winner mode

Winner mode allows you to undo/redo changes to window changes in Emacs.

Remember the previous window configurations and jump back to them as needed (as when, e.g., some other mode messes with your working layout.) Rebind the default keys to =C-c-up= and =C-c-down= as in a moment we'll assign =C-c-right= for rotating windows.

Winner Mode has been included with GNU Emacs since version 20 (https://www.emacswiki.org/emacs/WinnerMode) so no need for =use-package=.

#+source: local-winner-mode
#+begin_src emacs-lisp
;; (use-package winner
;;  :config
;;  (winner-mode t)
;;  :bind (("C-c <down>" . winner-undo)
;;         ("C-c <up>" . winner-redo)))

;; Old khj's code
(winner-mode 1)
(global-set-key (kbd "C-c <up>") 'winner-undo)
(global-set-key (kbd "C-c <down>") 'winner-redo)
#+end_src

#+RESULTS: local-winner-mode
: winner-redo

Restore the windows after Ediff quits. By default, when you quit the Ediff session with q, it just leaves the two diff windows around, instead of restoring the window configuration from when Ediff was started.

(Tip from https://caolan.org/dotfiles/emacs.html#orgd96aeb0)

#+BEGIN_SRC emacs-lisp 
(add-hook 'ediff-after-quit-hook-internal 'winner-undo)
#+END_SRC

#+RESULTS:
| winner-undo |

** Expand Region

   Expand selected region by semantic units. Just keep pressing the key until it selects what you want.

#+begin_src emacs-lisp
(use-package expand-region
  :defer t
  :bind (("s-<SPC>"       . er/expand-region)
         ("s-<backspace>" . er/contract-region)))
#+end_src

#+RESULTS: expand-region
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (23973 37848 504409 702000) :init (23973 37848 504337 958000) :init-secs (0 0 24 784000) :use-package-secs (0 0 142 83000)))

** COMMENT Multiple Cursors
   -Use multiple cursors for search, replace, and text-cleaning tasks. For a demonstration, see http://emacsrocks.com/e13.html
   Alternative customization at https://caolan.org/dotfiles/emacs.html#orgd96aeb0

See also http://pragmaticemacs.com/emacs/multiple-cursors/ and http://pragmaticemacs.com/emacs/add-multiple-cursors-with-mouse-clicks/

M-x mc/insert-numbers: By default, it inserts 0 for the first cursor, 1 for the second cursor etc, but you can change this by using a numeric prefix argument. So to get 1, 2, 3 as in your example, use C-u 1 M-x mc/insert-numbers.

HOWEVER, this is the possible cause of choppy cursor movement!! See https://www.reddit.com/r/emacs/comments/d46era/troubleshooting_choppy_cursor_movement/

#+source: multiple-cursors
#+begin_src emacs-lisp
;;(use-package multiple-cursors
;;  :defer t
;;  :bind
;;  ("C-c C-m l"   . mc/edit-lines) ; When you have an active region that spans multiple lines, add a cursor to each line
;;  ("C-c C-m d"   . mc/mark-all-dwim)
;;  ("C-c C-m A"   . mc/mark-all-like-this)
;;  ("C-c C-m a"   . mc/edit-beginnings-of-lines)
;;  ("C-c C-m e"   . mc/edit-ends-of-lines)
;;  ("C-c C-m E"   . mc/mark-more-like-this-extended)
;;  ("C-c C-m p"   . mc/mark-previous-lines)
;;  ("C-c C-m n"   . mc/mark-next-lines)
;;  ("C-c C-m P"   . mc/mark-previous-like-this)
;;  ("C-c C-m N"   . mc/mark-next-like-this) ;; works on same line! Cool! Warning: have to mark region first.
;;  ("C-c C-m h"   . mc-hide-unmatched-lines-mode)
;;  ("C-c C-m z"   . mc/insert-numbers)
;;  ("C-c C-m u"   . mc/unmark-next-like-this)
;;  ("C-c C-m U"   . mc/unmark-previous-like-this)
;;  ("C-c C-m r"   . mc/mark-all-in-region)
;;  )
#+end_src  

#+RESULTS: multiple-cursors
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (23913 40233 583591 570000) :init (23913 40233 582472 937000) :config (23913 40233 582421 924000) :config-secs (0 0 17 1000) :init-secs (0 0 118 611000) :use-package-secs (0 0 1469 621000)))

Previous code: 

#+BEGIN_EXAMPLE
  ;; When you have an active region that spans multiple lines, the following will add a cursor to each line:
  ; (global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)

    (global-set-key (kbd "s-{") 'mc/edit-lines)  ; esto no se' que' hace
  
  ;(global-set-key (kbd "C-S-c C-e") 'mc/edit-ends-of-lines)
  ;(global-set-key (kbd "C-S-c C-a") 'mc/edit-beginnings-of-lines)
  (global-set-key (kbd "s-(") 'mc/edit-beginnings-of-lines)
  (global-set-key (kbd "s-)") 'mc/edit-ends-of-lines)
  
  ;; When you want to add multiple cursors not based on continuous lines, but based on keywords in the buffer, use:
  ; (global-set-key (kbd "C->") 'mc/mark-next-like-this)
  (global-set-key (kbd "s-+") 'mc/mark-next-like-this)
  ;(global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
  (global-set-key (kbd "s-*") 'mc/mark-previous-like-this)
  (global-set-key (kbd "s-#") 'mc/unmark-next-like-this)
  (global-set-key (kbd "s-!") 'mc/unmark-previous-like-this)
  ;(global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this)
  (global-set-key (kbd "s-@") 'mc/mark-all-like-this) ; works on the same line! This is the coolest bit I think! Warning: have to mark region first.
  

  ;; DGM comments out on Feb 2019 cos no H key on my keyboard
  ;; Rectangular region mode
  ;(global-set-key (kbd "H-SPC") 'set-rectangular-region-anchor)
  
  ;; Mark more like this
  ;(global-set-key (kbd "H-a") 'mc/mark-all-like-this)
  ;(global-set-key (kbd "H-p") 'mc/mark-previous-like-this)
  ;(global-set-key (kbd "H-n") 'mc/mark-next-like-this)
  ;(global-set-key (kbd "H-S-n") 'mc/mark-more-like-this-extended)
  ;(global-set-key (kbd "H-S-a") 'mc/mark-all-in-region)
#+END_EXAMPLE

First mark the word, then add more cursors. To get out of multiple-cursors-mode, press <return> or C-g. The latter will first disable multiple regions before disabling multiple cursors. If you want to insert a newline in multiple-cursors-mode, use C-j.

